pressure-test/results/wrk2/load-20260504T071020Z.txt
Running 1m test @ http://host.docker.internal:20004
  4 threads and 64 connections
  Thread calibration: mean lat.: 4218.311ms, rate sampling interval: 15065ms
  Thread calibration: mean lat.: 4316.331ms, rate sampling interval: 16080ms
  Thread calibration: mean lat.: 4340.150ms, rate sampling interval: 16121ms
  Thread calibration: mean lat.: 4312.114ms, rate sampling interval: 16146ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.89s    13.18s    0.93m    58.11%
    Req/Sec    22.92      0.76    24.00     91.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   31.80s 
 75.000%   43.45s 
 90.000%   49.94s 
 99.000%    0.91m 
 99.900%    0.93m 
 99.990%    0.93m 
 99.999%    0.93m 
100.000%    0.93m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7790.591     0.000000            1         1.00
   13639.679     0.100000          473         1.11
   18415.615     0.200000          946         1.25
   22626.303     0.300000         1417         1.43
   27410.431     0.400000         1889         1.67
   31801.343     0.500000         2365         2.00
   34013.183     0.550000         2599         2.22
   36765.695     0.600000         2839         2.50
   39092.223     0.650000         3071         2.86
   41287.679     0.700000         3306         3.33
   43450.367     0.750000         3545         4.00
   44335.103     0.775000         3662         4.44
   45580.287     0.800000         3778         5.00
   46792.703     0.825000         3897         5.71
   47841.279     0.850000         4018         6.67
   48824.319     0.875000         4133         8.00
   49381.375     0.887500         4194         8.89
   49938.431     0.900000         4253        10.00
   50364.415     0.912500         4312        11.43
   50987.007     0.925000         4371        13.33
   51511.295     0.937500         4430        16.00
   51740.671     0.943750         4458        17.78
   52101.119     0.950000         4487        20.00
   52461.567     0.956250         4521        22.86
   52658.175     0.962500         4546        26.67
   53182.463     0.968750         4576        32.00
   53346.303     0.971875         4591        35.56
   53608.447     0.975000         4604        40.00
   53837.823     0.978125         4621        45.71
   54099.967     0.981250         4637        53.33
   54263.807     0.984375         4650        64.00
   54362.111     0.985938         4656        71.11
   54460.415     0.987500         4666        80.00
   54525.951     0.989062         4672        91.43
   54689.791     0.990625         4681       106.67
   54788.095     0.992188         4687       128.00
   54820.863     0.992969         4691       142.22
   54886.399     0.993750         4694       160.00
   54951.935     0.994531         4697       182.86
   55017.471     0.995313         4701       213.33
   55083.007     0.996094         4705       256.00
   55115.775     0.996484         4707       284.44
   55148.543     0.996875         4708       320.00
   55214.079     0.997266         4710       365.71
   55246.847     0.997656         4712       426.67
   55312.383     0.998047         4713       512.00
   55345.151     0.998242         4714       568.89
   55377.919     0.998437         4715       640.00
   55607.295     0.998633         4716       731.43
   55640.063     0.998828         4717       853.33
   55705.599     0.999023         4719      1024.00
   55705.599     0.999121         4719      1137.78
   55705.599     0.999219         4719      1280.00
   55705.599     0.999316         4719      1462.86
   55738.367     0.999414         4721      1706.67
   55738.367     0.999512         4721      2048.00
   55738.367     0.999561         4721      2275.56
   55738.367     0.999609         4721      2560.00
   55738.367     0.999658         4721      2925.71
   55738.367     0.999707         4721      3413.33
   55738.367     0.999756         4721      4096.00
   55738.367     0.999780         4721      4551.11
   55803.903     0.999805         4722      5120.00
   55803.903     1.000000         4722          inf
#[Mean    =    31886.425, StdDeviation   =    13176.153]
#[Max     =    55771.136, Total count    =         4722]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5658 requests in 1.00m, 1.16GB read
  Socket errors: connect 0, read 0, write 0, timeout 563
Requests/sec:     94.19
Transfer/sec:     19.76MB

Requests/sec: 94.19
p50 latency: 31801.34ms
p95 latency: 52101.12ms
p99 latency: 54624.25ms
max latency: 55771.14ms