pressure-test/results/wrk2/smoke-20260504T070109Z.txt
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
Running 30s test @ http://host.docker.internal:20004
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.750ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.680ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.24ms    4.38ms  56.00ms   91.85%
    Req/Sec   104.03    156.16     0.91k    86.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.02ms
 75.000%    4.02ms
 90.000%    7.30ms
 99.000%   23.12ms
 99.900%   47.74ms
 99.990%   56.03ms
 99.999%   56.03ms
100.000%   56.03ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.696     0.000000            1         1.00
       2.040     0.100000          399         1.11
       2.323     0.200000          798         1.25
       2.549     0.300000         1198         1.43
       2.775     0.400000         1599         1.67
       3.023     0.500000         1995         2.00
       3.143     0.550000         2197         2.22
       3.271     0.600000         2399         2.50
       3.437     0.650000         2596         2.86
       3.663     0.700000         2793         3.33
       4.017     0.750000         2993         4.00
       4.231     0.775000         3093         4.44
       4.519     0.800000         3194         5.00
       4.911     0.825000         3292         5.71
       5.379     0.850000         3392         6.67
       6.047     0.875000         3492         8.00
       6.563     0.887500         3542         8.89
       7.303     0.900000         3591        10.00
       8.119     0.912500         3642        11.43
       9.375     0.925000         3691        13.33
      10.487     0.937500         3741        16.00
      10.975     0.943750         3766        17.78
      11.927     0.950000         3791        20.00
      12.783     0.956250         3816        22.86
      13.639     0.962500         3841        26.67
      14.367     0.968750         3866        32.00
      14.743     0.971875         3878        35.56
      15.783     0.975000         3891        40.00
      16.767     0.978125         3903        45.71
      18.079     0.981250         3916        53.33
      18.847     0.984375         3928        64.00
      20.335     0.985938         3934        71.11
      20.783     0.987500         3941        80.00
      21.343     0.989062         3947        91.43
      23.807     0.990625         3953       106.67
      25.551     0.992188         3959       128.00
      25.727     0.992969         3962       142.22
      28.143     0.993750         3966       160.00
      33.087     0.994531         3969       182.86
      33.311     0.995313         3973       213.33
      33.471     0.996094         3975       256.00
      33.727     0.996484         3976       284.44
      40.255     0.996875         3978       320.00
      43.231     0.997266         3980       365.71
      46.655     0.997656         3981       426.67
      46.975     0.998047         3983       512.00
      46.975     0.998242         3983       568.89
      47.295     0.998437         3985       640.00
      47.295     0.998633         3985       731.43
      47.743     0.998828         3986       853.33
      47.839     0.999023         3987      1024.00
      47.839     0.999121         3987      1137.78
      47.839     0.999219         3987      1280.00
      48.159     0.999316         3988      1462.86
      48.159     0.999414         3988      1706.67
      51.839     0.999512         3989      2048.00
      51.839     0.999561         3989      2275.56
      51.839     0.999609         3989      2560.00
      51.839     0.999658         3989      2925.71
      51.839     0.999707         3989      3413.33
      56.031     0.999756         3990      4096.00
      56.031     1.000000         3990          inf
#[Mean    =        4.239, StdDeviation   =        4.376]
#[Max     =       56.000, Total count    =         3990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5902 requests in 30.00s, 3.19MB read
  Non-2xx or 3xx responses: 5902
Requests/sec:    196.71
Transfer/sec:    108.96KB