pressure-test/results/wrk2/smoke-20260504T070409Z.txt
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
D:/Git/scripts/plan_list.lua: cannot open D:/Git/scripts/plan_list.lua: No such file or directory
Running 30s test @ http://host.docker.internal:20004
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.685ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.710ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.75ms    5.17ms  37.44ms   88.20%
    Req/Sec   103.79     99.05   416.00     43.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.71ms
 75.000%    5.22ms
 90.000%   11.14ms
 99.000%   27.73ms
 99.900%   36.13ms
 99.990%   37.47ms
 99.999%   37.47ms
100.000%   37.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.652     0.000000            1         1.00
       1.521     0.100000          400         1.11
       1.790     0.200000          798         1.25
       2.042     0.300000         1197         1.43
       2.349     0.400000         1597         1.67
       2.707     0.500000         1997         2.00
       2.927     0.550000         2195         2.22
       3.187     0.600000         2394         2.50
       3.585     0.650000         2594         2.86
       4.343     0.700000         2794         3.33
       5.215     0.750000         2993         4.00
       5.883     0.775000         3093         4.44
       6.527     0.800000         3192         5.00
       7.183     0.825000         3293         5.71
       8.011     0.850000         3392         6.67
       9.503     0.875000         3492         8.00
      10.231     0.887500         3542         8.89
      11.135     0.900000         3591        10.00
      12.023     0.912500         3641        11.43
      13.047     0.925000         3691        13.33
      14.583     0.937500         3741        16.00
      15.095     0.943750         3766        17.78
      15.783     0.950000         3791        20.00
      16.911     0.956250         3816        22.86
      17.727     0.962500         3841        26.67
      18.495     0.968750         3866        32.00
      19.135     0.971875         3878        35.56
      19.791     0.975000         3891        40.00
      21.423     0.978125         3903        45.71
      22.607     0.981250         3917        53.33
      23.775     0.984375         3928        64.00
      24.431     0.985938         3934        71.11
      26.799     0.987500         3941        80.00
      27.551     0.989062         3947        91.43
      27.855     0.990625         3953       106.67
      28.511     0.992188         3959       128.00
      29.199     0.992969         3962       142.22
      30.767     0.993750         3966       160.00
      31.119     0.994531         3969       182.86
      32.335     0.995313         3972       213.33
      32.655     0.996094         3975       256.00
      32.831     0.996484         3976       284.44
      32.895     0.996875         3978       320.00
      34.271     0.997266         3980       365.71
      34.559     0.997656         3981       426.67
      35.295     0.998047         3983       512.00
      35.295     0.998242         3983       568.89
      35.423     0.998437         3984       640.00
      36.095     0.998633         3985       731.43
      36.127     0.998828         3986       853.33
      36.383     0.999023         3987      1024.00
      36.383     0.999121         3987      1137.78
      36.383     0.999219         3987      1280.00
      36.575     0.999316         3988      1462.86
      36.575     0.999414         3988      1706.67
      37.407     0.999512         3989      2048.00
      37.407     0.999561         3989      2275.56
      37.407     0.999609         3989      2560.00
      37.407     0.999658         3989      2925.71
      37.407     0.999707         3989      3413.33
      37.471     0.999756         3990      4096.00
      37.471     1.000000         3990          inf
#[Mean    =        4.752, StdDeviation   =        5.167]
#[Max     =       37.440, Total count    =         3990]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 3.25MB read
  Non-2xx or 3xx responses: 6002
Requests/sec:    200.05
Transfer/sec:    110.81KB